{
  "guilt": [
    "One snack or heavy meal doesn't erase your progress. What matters is the pattern over weeks, not one day.",
    "You don’t need to punish yourself for eating. Let’s look at one small change you can make at your next meal instead.",
    "Feeling guilty after eating is very common, but the guilt itself doesn’t help. Knowledge and small actions do."
  ],
  "praise": [
    "Love that you’re asking questions instead of trusting random posts online. That’s already a big win.",
    "Nice choice – this kind of balanced meal makes it much easier to reach your goals over time.",
    "You’re building skills, not following a 3-day fad. That’s how real change starts."
  ],
  "encouragement": [
    "You don’t have to be perfect to get healthier. You just have to be slightly more consistent than last month.",
    "Small changes in food, sleep and movement compound over time like interest in a savings account.",
    "Even reading this information is progress – most people never question the nutrition myths they are told."
  ],
  "dangerous_myth": [
    "I’m glad you asked before trying that. Some of these trends can genuinely harm your health.",
    "Your body is not a science experiment for extreme detoxes. Let’s find a safer strategy that still fits your goals."
  ],
  "healthy_choice": [
    "This is a really solid option – high in nutrients and pretty filling for the calories.",
    "Choosing this more often and keeping treats as occasional is a powerful long-term strategy."
  ],
  "relapse_or_slip": [
    "One off-plan meal doesn’t mean you failed. Treat it as data, not drama, and we adjust the next few choices.",
    "Imagine zooming out to a whole month – this one moment will barely show up if you keep going."
  ],
  "info_overload": [
    "Nutrition online can feel overwhelming because you're seeing hundreds of opinions at once. Focusing on a few solid habits beats chasing every new rule.",
    "If you're feeling overloaded, we can zoom back to basics: more plants, enough protein, fewer sugary drinks and consistent sleep.",
    "There's a lot of conflicting info out there. Let's stick to what's proven and practical for you."
  ],
  "first_time_user": [
    "Welcome! I'm here to help you make sense of nutrition advice and debunk myths. Ask me about any food or health claim you've heard!",
    "Hi there! Ready to separate nutrition facts from fiction? I've got evidence-based answers for you.",
    "Hey! Think of me as your science-backed nutrition friend. No judgment, just helpful info."
  ],
  "confused": [
    "I'm not quite sure what you're asking about. Could you rephrase or give me a specific food or myth you want to know about?",
    "Hmm, I didn't catch that. Try asking about a specific food item, nutrition myth, or health goal.",
    "Let's try that again! Ask me about a food (like 'bubble tea'), a myth (like 'carbs make you fat'), or tell me your health goal."
  ],
  "goal_celebration": [
    "You're making real progress! Keep up this momentum and you'll hit your goals.",
    "Look at you go! These consistent choices are exactly what sustainable change looks like.",
    "Awesome work! You're building habits that will last way beyond any quick-fix diet."
  ],
  "motivational": [
    "Your future self will thank you for the choices you're making today.",
    "Healthy eating isn't about perfection—it's about making better choices more often than not.",
    "You don't need to overhaul your entire life at once. Small, consistent steps create lasting change.",
    "Remember: progress, not perfection. Every healthy choice counts."
  ],
  "guilt": [
    "One snack or heavy meal doesn't erase your progress. What matters is the pattern over weeks, not one day.",
    "You don't need to punish yourself for eating. Let's look at one small change you can make at your next meal instead.",
    "Feeling guilty after eating is very common, but the guilt itself doesn't help. Knowledge and small actions do.",
    "Food is fuel and enjoyment, not something to feel bad about. Let's focus on what you can do next."
  ],
  "praise": [
    "Love that you're asking questions instead of trusting random posts online. That's already a big win.",
    "Nice choice – this kind of balanced meal makes it much easier to reach your goals over time.",
    "You're building skills, not following a 3-day fad. That's how real change starts.",
    "Great job choosing that! You're making informed decisions and that's what matters."
  ]
}
